/*
 * ekknod@2021-2022
 *
 * these methods were part of my hobby anti-cheat, and decided to make it public.
 * it's targetted against common kernel drivers.
 *
 * current methods:
 * - Catch hidden / Unlinked system threads
 * - Catch execution outside of valid module range
 * - Catch KeStackAttachMemory/MmCopyVirtualMemory/ReadProcessMemory
 * - Catch manual MouseClassServiceCallback call
 */

#include <intrin.h>
#include <ntifs.h>




#define TARGET_PROCESS "csgo.exe"




#ifndef CUSTOMTYPES
#define CUSTOMTYPES
typedef ULONG_PTR QWORD;
typedef ULONG DWORD;
typedef int BOOL;
typedef unsigned char BYTE;
typedef unsigned short WORD;
#endif


typedef struct {
	QWORD base, size;
} IMAGE_INFO_TABLE;


//
// uefi runtime services, used for whitelisting some non kernel addresses
//
QWORD            HalEfiFunctions[8];
IMAGE_INFO_TABLE HalEfiImages[8];
BOOL             HalEfiEnabled = 0;



//
// vmware
//
IMAGE_INFO_TABLE vmusbmouse;



//
// DriverEntry/DriverUnload
//
PDRIVER_OBJECT gDriverObject;
PVOID thread_object;
HANDLE thread_handle;
BOOLEAN gExitCalled;



//
// MouseClassServiceCallbackHook
//
#pragma warning(disable : 4201)
typedef struct _MOUSE_INPUT_DATA {
	USHORT UnitId;
	USHORT Flags;
	union {
		ULONG Buttons;
		struct {
			USHORT ButtonFlags;
			USHORT ButtonData;
		};
	};
	ULONG  RawButtons;
	LONG   LastX;
	LONG   LastY;
	ULONG  ExtraInformation;
} MOUSE_INPUT_DATA, * PMOUSE_INPUT_DATA;

typedef VOID
(*MouseClassServiceCallbackFn)(
	PDEVICE_OBJECT DeviceObject,
	PMOUSE_INPUT_DATA InputDataStart,
	PMOUSE_INPUT_DATA InputDataEnd,
	PULONG InputDataConsumed
	);

typedef struct _MOUSE_OBJECT
{
	PDEVICE_OBJECT              mouse_device;
	MouseClassServiceCallbackFn service_callback;
	BOOL                        hook;
	QWORD                       hid;
	QWORD                       hid_length;
} MOUSE_OBJECT, * PMOUSE_OBJECT;

MOUSE_OBJECT gMouseObject;
QWORD _KeAcquireSpinLockAtDpcLevel;
QWORD _KeReleaseSpinLockFromDpcLevel;
QWORD _IofCompleteRequest;
QWORD _IoReleaseRemoveLockEx;
BOOL mouse_hook(void);
void mouse_unhook(void);
QWORD MouseClassServiceCallback(
	PDEVICE_OBJECT DeviceObject,
	PMOUSE_INPUT_DATA InputDataStart,
	PMOUSE_INPUT_DATA InputDataEnd,
	PULONG InputDataConsumed
);



//
// helper functions
//
QWORD GetMilliSeconds();
QWORD GetProcAddressQ(QWORD base, PCSTR name);
QWORD FindPattern(QWORD module, BYTE* bMask, CHAR* szMask, QWORD len);
PVOID ResolveRelativeAddress(
	_In_ PVOID Instruction,
	_In_ ULONG OffsetOffset,
	_In_ ULONG InstructionSize
);
BOOL ResolveHalEfiBase(QWORD address, QWORD* base, QWORD* size);
QWORD GetModuleHandle(PWCH module_name, QWORD* SizeOfImage);
QWORD GetProcessByName(const char* process_name);
BOOL IsThreadFoundEPROCESS(QWORD process, QWORD thread);
void NtSleep(DWORD milliseconds);
__declspec(dllimport) PCSTR PsGetProcessImageFileName(QWORD process);
__declspec(dllimport) BOOLEAN PsGetProcessExitProcessCalled(PEPROCESS process);
typedef struct _KPRCB* PKPRCB;
__declspec(dllimport) PKPRCB KeQueryPrcbAddress(__in ULONG Number);
__int64 (__fastcall *MiGetPteAddress)(unsigned __int64 a1);


//
// complete functions
//
BOOL IsInValidRange(QWORD address);
BOOL GetThreadStack(QWORD thread, CONTEXT* thread_context);



//
// Anti Cheat checks
//
QWORD MouseClassServiceCallbackHook(
	PDEVICE_OBJECT DeviceObject,
	PMOUSE_INPUT_DATA InputDataStart,
	PMOUSE_INPUT_DATA InputDataEnd,
	PULONG InputDataConsumed
)
{
	QWORD address = (QWORD)_ReturnAddress();
	if (address < (QWORD)gMouseObject.hid || address >(QWORD)((QWORD)gMouseObject.hid + gMouseObject.hid_length))
	{
		// extra check for vmware virtual machine
		if (address < (QWORD)vmusbmouse.base || address >(QWORD)((QWORD)vmusbmouse.base + vmusbmouse.size))
		{
			QWORD thread = (QWORD)PsGetCurrentThread();

			DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL,
				"Mouse manipulation was detected (%ld, %llx)\n",
				(DWORD)(QWORD)PsGetThreadId((PETHREAD)thread),
				thread
			);
		}
	}

	// C/C++ -> All Options -> Control Overflow Guard : OFF, otherwise compiler will create CALL instruction and it will BSOD.
	// Sadly inline assembly is not supported by x64 C/C++.
	return ((QWORD(*)(PDEVICE_OBJECT, PMOUSE_INPUT_DATA, PMOUSE_INPUT_DATA, PULONG))((QWORD)MouseClassServiceCallback + 5))(
		DeviceObject,
		InputDataStart,
		InputDataEnd,
		InputDataConsumed
		);


}

BOOL AntiCheatUnlinkDetection(QWORD thread)
{
	BOOL hidden = 0;

	if (thread == 0)
		return 0;

	QWORD host_process = *(QWORD*)(thread + 0x220);
	if (!IsThreadFoundEPROCESS(host_process, thread))
	{
		DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, "Hidden thread found [%s %d], %llx, %d]\n",
			PsGetProcessImageFileName(host_process),

			PsGetProcessId((PEPROCESS)host_process),

			thread,
			(DWORD)(QWORD)PsGetThreadId((PETHREAD)thread)
		);

		hidden = 1;
	}

	return hidden;
}

BOOL AntiCheatAttachProcessDetection(QWORD target_game, QWORD thread)
{
	BOOL attach = 0;

	if (thread == 0)
		return 0;

	if (target_game == 0)
		return 0;

	QWORD host_process = *(QWORD*)(thread + 0x220);
	if (target_game == host_process)
		return 0;


	if (*(QWORD*)(thread + 0x98 + 0x20) == target_game) {
		DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, "[%s] Thread (%llx, %ld) is attached to %s\n",
			PsGetProcessImageFileName(host_process),
			thread,
			(DWORD)(QWORD)PsGetThreadId((PETHREAD)thread),
			PsGetProcessImageFileName(*(QWORD*)(thread + 0x98 + 0x20))
		);

		attach = 1;
	}

	return attach;
}

BOOL AntiCheatInvalidRangeDetection(QWORD thread, CONTEXT ctx)
{
	BOOL invalid_range = 0;

	if (thread == 0)
		return 0;


	
	if (!IsInValidRange(ctx.Rip)) {
		QWORD host_process = *(QWORD*)(thread + 0x220);
		DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, "[%s] Thread is outside of valid module [%ld, %llx] RIP[%llx]\n",
			PsGetProcessImageFileName(host_process),
			(DWORD)(QWORD)PsGetThreadId((PETHREAD)thread),
			thread,
			ctx.Rip
		);
		invalid_range = 1;
	}


	return invalid_range;
}

void AntiCheat(QWORD target_game)
{
	QWORD current_thread, next_thread;

	for (int i = 0; i < KeNumberProcessors; i++) {
		PKPRCB prcb = KeQueryPrcbAddress(i);


		if (prcb == 0)
			continue;

		current_thread = *(QWORD*)((QWORD)prcb + 0x8);
		next_thread = *(QWORD*)((QWORD)prcb + 0x10);
		if (current_thread != 0 && current_thread != (QWORD)PsGetCurrentThread())
		{
			AntiCheatAttachProcessDetection(target_game, current_thread);

			CONTEXT ctx;
			ctx.ContextFlags = CONTEXT_ALL;
			if (GetThreadStack(current_thread, &ctx)) {
				AntiCheatInvalidRangeDetection(current_thread, ctx);
			}
		}

		if (next_thread != 0 && next_thread != (QWORD)PsGetCurrentThread())
		{
			AntiCheatUnlinkDetection(next_thread);
			AntiCheatAttachProcessDetection(target_game, next_thread);
		}
	}
}

VOID
DriverUnload(
	_In_ struct _DRIVER_OBJECT* DriverObject
)
{

	(DriverObject);
	gExitCalled = 1;

	mouse_unhook();

	if (thread_object) {
		KeWaitForSingleObject(
			(PVOID)thread_object,
			Executive,
			KernelMode,
			FALSE,
			0
		);

		ObDereferenceObject(thread_object);

		ZwClose(thread_handle);
	}


	// Lets wait second, everything should be unloaded now.
	NtSleep(1000);

	DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, "[+] Anti-Cheat.sys is closed\n");
}

NTSTATUS system_thread(void)
{
	DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, "[+] Anti-Cheat.sys is launched\n");

	QWORD target_game = 0;






	// QWORD prev_ms = GetMilliSeconds();

	while (gExitCalled == 0) {

		NtSleep(1);

		if (target_game == 0 || PsGetProcessExitProcessCalled((PEPROCESS)target_game)) {
			target_game = GetProcessByName(TARGET_PROCESS);

			if (target_game == 0)
				goto skip_address;
		}
	skip_address:
		AntiCheat(target_game);
		/*
		QWORD ms = GetMilliSeconds();
		if (ms - prev_ms > 30000)
		{
			prev_ms = ms;
			for (int i = 0; i < suspect_list; i++)
			{
				PrintSuspects(suspects);
			}
		}
		*/
	}

	DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, "[+] Anti-Cheat.sys thread is closed\n");

	return 0l;
}

NTSTATUS DriverEntry(
	_In_ PDRIVER_OBJECT  DriverObject,
	_In_ PUNICODE_STRING RegistryPath
)
{

	(DriverObject);
	(RegistryPath);

	gDriverObject = DriverObject;
	DriverObject->DriverUnload = DriverUnload;

	vmusbmouse.base = GetModuleHandle(L"vmusbmouse.sys", &vmusbmouse.size);
	QWORD ntoskrnl = GetModuleHandle(L"ntoskrnl.exe", 0);


	QWORD MmUnlockPreChargedPagedPool = GetProcAddressQ((QWORD)ntoskrnl, "MmUnlockPreChargedPagedPool");
	if (MmUnlockPreChargedPagedPool == 0)
		return STATUS_DRIVER_ENTRYPOINT_NOT_FOUND;


	*(QWORD*)&MiGetPteAddress = (QWORD)(*(int*)(MmUnlockPreChargedPagedPool + 8) + MmUnlockPreChargedPagedPool + 12);


	QWORD table = 0;
	if (ntoskrnl)
		table = FindPattern((QWORD)ntoskrnl, (BYTE*)"\x48\x83\xEC\x30\x48\x8B\x05\x00\x00\x00\x00\x4D\x8B\xD0", "xxxxxxx????xxx", 15);

	if (!table)
	{
		QWORD hal = GetModuleHandle(L"hal.dll", 0);
		if (hal)
			table = FindPattern((QWORD)hal, (BYTE*)"\x48\x83\xEC\x30\x48\x8B\x05\x00\x00\x00\x00\x4D\x8B\xD0", "xxxxxxx????xxx", 15);
	}

	if (table) {
		table = table + 0x04;
		table = (QWORD)ResolveRelativeAddress((PVOID)table, 3, 7);
		table = *(QWORD*)table;
		HalEfiEnabled = 1;
		for (int i = 0; i < 8; i++) {
			HalEfiFunctions[i] = *(QWORD*)(table + (i * 8));
		}
	}

	if (HalEfiEnabled && HalEfiFunctions[0] != 0)
	{
		
		for (int i = 0; i < 8; i++)
		{
			
			if (!ResolveHalEfiBase(HalEfiFunctions[i], &HalEfiImages[i].base, &HalEfiImages[i].size))
			{
				HalEfiEnabled = 0;
				break;
			}

			if (HalEfiFunctions[i] && *(unsigned short*)(HalEfiFunctions[i]) == 0x25ff)
			{
				DbgPrintEx(0x71, 0, "[+] EFI Runtime service (%d) is most likely manipulated by bytepatch: %llx\n",
					i, *(QWORD*)(HalEfiFunctions[i] + 0x6));
			}

			if (HalEfiEnabled == 0)
				continue;
			
			if (HalEfiFunctions[i] < HalEfiImages[i].base || HalEfiFunctions[i] > (HalEfiImages[i].base + HalEfiImages[i].size))
			{
				DbgPrintEx(0x71, 0, "[+] EFI Runtime service (%d) is not pointing at original Image: %llx\n", i, HalEfiFunctions[i]);
			}
		}
	}

	mouse_hook();

	CLIENT_ID thread_id;
	PsCreateSystemThread(&thread_handle, STANDARD_RIGHTS_ALL, NULL, NULL, &thread_id, (PKSTART_ROUTINE)system_thread, (PVOID)0);
	ObReferenceObjectByHandle(
		thread_handle,
		THREAD_ALL_ACCESS,
		NULL,
		KernelMode,
		(PVOID*)&thread_object,
		NULL
	);

	return STATUS_SUCCESS;
}

typedef struct _KLDR_DATA_TABLE_ENTRY {
	LIST_ENTRY InLoadOrderLinks;
	VOID* ExceptionTable;
	UINT32 ExceptionTableSize;
	VOID* GpValue;
	VOID* NonPagedDebugInfo;
	VOID* ImageBase;
	VOID* EntryPoint;
	UINT32 SizeOfImage;
	UNICODE_STRING FullImageName;
	UNICODE_STRING BaseImageName;
} LDR_DATA_TABLE_ENTRY, * PLDR_DATA_TABLE_ENTRY;


BOOL IsInValidRange(QWORD address)
{
	
	if (HalEfiEnabled)
	{
		for (int i = 0; i < 8; i++)
		{
			if (address >= HalEfiImages[i].base && address <= (QWORD)(HalEfiImages[i].base + HalEfiImages[i].size))
			{
				return 1;
			}
		}
	}

	

	PLDR_DATA_TABLE_ENTRY ldr = (PLDR_DATA_TABLE_ENTRY)gDriverObject->DriverSection;
	for (PLIST_ENTRY pListEntry = ldr->InLoadOrderLinks.Flink; pListEntry != &ldr->InLoadOrderLinks; pListEntry = pListEntry->Flink)
	{
		PLDR_DATA_TABLE_ENTRY pEntry = CONTAINING_RECORD(pListEntry, LDR_DATA_TABLE_ENTRY, InLoadOrderLinks);
		if (pEntry->ImageBase == 0)
			continue;

		if (address >= (QWORD)pEntry->ImageBase && address <= (QWORD)((QWORD)pEntry->ImageBase + pEntry->SizeOfImage + 0x1000))
			return 1;

	}
	return 0;
}

#pragma warning(disable : 4201)

typedef struct MISC_FLAGS {
	union
	{
		struct
		{
			ULONG AutoBoostActive : 1;                                        //0x74
			ULONG ReadyTransition : 1;                                        //0x74
			ULONG WaitNext : 1;                                               //0x74
			ULONG SystemAffinityActive : 1;                                   //0x74
			ULONG Alertable : 1;                                              //0x74
			ULONG UserStackWalkActive : 1;                                    //0x74
			ULONG ApcInterruptRequest : 1;                                    //0x74
			ULONG QuantumEndMigrate : 1;                                      //0x74
			ULONG UmsDirectedSwitchEnable : 1;                                //0x74
			ULONG TimerActive : 1;                                            //0x74
			ULONG SystemThread : 1;                                           //0x74
			ULONG ProcessDetachActive : 1;                                    //0x74
			ULONG CalloutActive : 1;                                          //0x74
			ULONG ScbReadyQueue : 1;                                          //0x74
			ULONG ApcQueueable : 1;                                           //0x74
			ULONG ReservedStackInUse : 1;                                     //0x74
			ULONG UmsPerformingSyscall : 1;                                   //0x74
			ULONG TimerSuspended : 1;                                         //0x74
			ULONG SuspendedWaitMode : 1;                                      //0x74
			ULONG SuspendSchedulerApcWait : 1;                                //0x74
			ULONG CetUserShadowStack : 1;                                     //0x74
			ULONG BypassProcessFreeze : 1;                                    //0x74
			ULONG Reserved : 10;                                              //0x74
		};
		LONG MiscFlags;                                                     //0x74
	};
} MISC_FLAGS;


QWORD GetModuleHandle(PWCH module_name, QWORD* SizeOfImage)
{
	PLDR_DATA_TABLE_ENTRY ldr = (PLDR_DATA_TABLE_ENTRY)gDriverObject->DriverSection;
	for (PLIST_ENTRY pListEntry = ldr->InLoadOrderLinks.Flink; pListEntry != &ldr->InLoadOrderLinks; pListEntry = pListEntry->Flink)
	{

		PLDR_DATA_TABLE_ENTRY pEntry = CONTAINING_RECORD(pListEntry, LDR_DATA_TABLE_ENTRY, InLoadOrderLinks);

		if (pEntry->BaseImageName.Buffer && wcscmp(pEntry->BaseImageName.Buffer, module_name) == 0) {
			if (SizeOfImage) {
				*SizeOfImage = 0;
				*SizeOfImage = pEntry->SizeOfImage;
			}
			return (QWORD)pEntry->ImageBase;
		}

	}

	return 0;
}


// https://github.com/btbd/umap/blob/master/mapper/util.c#L117
BOOLEAN MemCopyWP(PVOID dest, PVOID src, ULONG length) {
	PMDL mdl = IoAllocateMdl(dest, length, FALSE, FALSE, NULL);
	if (!mdl) {
		return FALSE;
	}

	MmProbeAndLockPages(mdl, KernelMode, IoModifyAccess);

